MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX675F256L.atdf
      <value-group caption="Channel Chain Enable bit" name="DCH4CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH4CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH4CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH4CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH4CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH5CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3" />
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2" />
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1" />
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0" />
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH5CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH5CON__CHAEN">
         <value caption="Channel is continuously enabled and not automatically disabled after a block transfer is complete" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH5CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH5CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH5CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH5CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH5CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH6CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3" />
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2" />
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1" />
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0" />
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH6CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH6CON__CHAEN">
         <value caption="Channel is continuously enabled and not automatically disabled after a block transfer is complete" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH6CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH6CON__CHAED">
         <value caption="Channel start/abort events will be registered even if the channel is disabled" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH6CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH6CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
