MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX675F256L.atdf
         <register caption="" name="SPI1STAT" offset="0x610" rw="R" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI1STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI1STAT__SPITBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI1STAT__SPITBE" />
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI1STAT__SPIRBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI1STAT__SPIROV" />
            <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI1STAT__SRMT" />
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI1STAT__SPITUR" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI1STAT__SPIBUSY" />
            <bitfield mask="0x001F0000" name="TXBUFELM" />
            <bitfield mask="0x1F000000" name="RXBUFELM" />
         </register>
         <register caption="" name="SPI3BUF" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI3BUF" />
         </register>
         <register caption="" name="SPI2BUF" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI2BUF" />
         </register>
         <register caption="" name="SPI4BUF" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI4BUF" />
         </register>
         <register caption="" name="SPI1BUF" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="SPI1BUF" />
         </register>
         <register caption="" name="SPI3BRG" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI3BRG" />
         </register>
         <register caption="" name="SPI2BRG" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI2BRG" />
         </register>
         <register caption="" name="SPI4BRG" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI4BRG" />
         </register>
         <register caption="" name="SPI1BRG" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x000001FF" name="SPI1BRG" />
         </register>
      </register-group>
      <value-group caption="SPI Receive Buffer Full Interrupt Mode bits" name="SPI3CON__SRXISEL">
         <value caption="Interrupt is generated when the buffer is full" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is full by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is not empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last word in the receive buffer is read (i.e. buffer is empty)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Interrupt Mode bits" name="SPI3CON__STXISEL">
         <value caption="Interrupt is generated when the buffer is not full (has one or more empty elements)" name="" value="0x3" />
         <value caption="Interrupt is generated when the buffer is empty by one-half or more" name="" value="0x2" />
         <value caption="Interrupt is generated when the buffer is completely empty" name="" value="0x1" />
         <value caption="Interrupt is generated when the last transfer is shifted out of SPISR and transmit operations are complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Mode Enable bit" name="SPI3CON__MSTEN">
         <value caption="Master mode" name="" value="0x1" />
         <value caption="Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Polarity Select bit" name="SPI3CON__CKP">
         <value caption="Idle state for clock is a high level; active state is a low level" name="" value="0x1" />
         <value caption="Idle state for clock is a low level; active state is a high level" name="" value="0x0" />
      </value-group>
      <value-group caption="Slave Select Enable bit" name="SPI3CON__SSEN">
         <value caption="SSx pin used for Slave mode" name="" value="0x1" />
         <value caption="SSx pin not used for Slave mode" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Clock Edge Select bit" name="SPI3CON__CKE">
         <value caption="Serial output data changes on transition from active clock state to Idle clock state (see CKP bit)" name="" value="0x1" />
         <value caption="Serial output data changes on transition from Idle clock state to active clock state (see CKP bit)" name="" value="0x0" />
      </value-group>
      <value-group caption="SPI Data Input Sample Phase bit (master mode only)" name="SPI3CON__SMP">
         <value caption="(Master mode) Input data sampled at end of data output time / (Slave mode) value is ignored" name="" value="0x1" />
         <value caption="(Master mode) Input data sampled at middle of data output time / (Slave mode) value is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="32/16-Bit Communication Select bits" name="SPI3CON__MODE32">
         <value caption="(AUDEN=1) 24-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame / (AUDEN=0) 32-bit communication" name="" value="0x3" />
         <value caption="(AUDEN=1) 32-bit Data, 32-bit FIFO, 32-bit Channel/64-bit Frame / (AUDEN=0) 32-bit communication" name="" value="0x2" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 32-bit Channel/64-bit Frame / (AUDEN=0) 16-bit communication" name="" value="0x1" />
         <value caption="(AUDEN=1) 16-bit Data, 16-bit FIFO, 16-bit Channel/32-bit Frame / (AUDEN=0) 8-bit communication" name="" value="0x0" />
      </value-group>
